app/Controllers/UsuarioController.php

          }

          if ($tipo == 'administrador') {
              $data['usuario'] = $usuarioModel->where('email', $email)
                  ->where('contraseña', $contraseña)
                  ->where('paciente', NULL)
                  ->where('doctor', NULL)
                  ->findAll();
---
SELECT *
FROM `usuario`
WHERE `email` = 'mauri.admin@outlook.es'
AND `contraseña` = 'admin1'
AND `paciente` IS NULL
AND `doctor` IS NULL
AND `usuario`.`deleted_at` IS NULL